[
  {
    "id": 1,
    "title": "ChatMaster",
    "companyName": "NeuraSoft",
    "description": "ChatMaster is your ultimate AI-powered assistant for daily life. It helps you write messages, schedule tasks, and answer questions instantly. Stay organized with its smart reminders. Experience natural conversations like never before. Make your day smoother with ChatMaster.",
    "size": 45,
    "reviews": "12.5k",
    "ratingAvg": 4.6,
    "downloads": "5M",
    "image": "https://i.ibb.co.com/n85d4X9D/chatmaster.jpg"
  },
  {
    "id": 2,
    "title": "SnapWave",
    "companyName": "PixelForge",
    "description": "SnapWave lets you edit photos with modern filters and tools. Add creative effects to your pictures effortlessly. Share your edits directly to social media. Enjoy a fast and smooth editing experience. Turn every photo into a masterpiece with SnapWave.",
    "size": 80,
    "reviews": "18k",
    "ratingAvg": 4.2,
    "downloads": "8M",
    "image": "https://i.ibb.co.com/XxDzcFBk/Pixel-Forge.webp"
  },
  {
    "id": 3,
    "title": "FitTrack",
    "companyName": "Healthify",
    "description": "FitTrack helps you monitor your workouts and fitness goals. Track calories, steps, and sleep easily. Set daily reminders for your health habits. Get personalized fitness insights and progress charts. Stay motivated and healthy with FitTrack.",
    "size": 52,
    "reviews": "9.8k",
    "ratingAvg": 4.5,
    "downloads": "3M",
    "image": "https://i.ibb.co.com/JjhLHFcg/FitTrack.webp"
  },
  {
    "id": 4,
    "title": "TuneVibe",
    "companyName": "MelodyWorks",
    "description": "TuneVibe brings your favorite songs and podcasts in one place. Discover trending music and exclusive playlists. Create your own vibe with custom collections. Enjoy offline listening anytime. Feel every beat with TuneVibe.",
    "size": 120,
    "reviews": "24.5k",
    "ratingAvg": 4.7,
    "downloads": "12M",
    "image": "https://i.ibb.co.com/1Y6Th8f2/TuneVibe.jpg"
  },
  {
    "id": 5,
    "title": "QuickLearn",
    "companyName": "EduSpark",
    "description": "QuickLearn offers interactive online courses across multiple fields. Learn at your own pace with expert instructors. Track your learning journey with progress reports. Get quizzes and assignments for better practice. Upskill yourself easily with QuickLearn.",
    "size": 95,
    "reviews": "15.4k",
    "ratingAvg": 4.3,
    "downloads": "9M",
    "image": "https://i.ibb.co.com/4n6HgVJR/Quick-Learn.jpg"
  },
  {
    "id": 6,
    "title": "ShopZone",
    "companyName": "EcomWorld",
    "description": "ShopZone gives you a seamless online shopping experience. Browse millions of products at great prices. Enjoy fast delivery and secure payments. Track your orders in real-time. Shopping made smart and simple with ShopZone.",
    "size": 68,
    "reviews": "30k",
    "ratingAvg": 4.4,
    "downloads": "20M",
    "image": "https://i.ibb.co.com/ZpzP6kvD/ShopZone.jpg"
  },
  {
    "id": 7,
    "title": "GameHub",
    "companyName": "PlayVerse",
    "description": "GameHub is your one-stop place for mobile games. Discover trending titles and hidden gems. Connect with other gamers globally. Track your playtime and achievements. Level up your gaming experience with GameHub.",
    "size": 110,
    "reviews": "21k",
    "ratingAvg": 4.1,
    "downloads": "7M",
    "image": "https://i.ibb.co.com/h1BwMqgq/GameHub.jpg"
  },
  {
    "id": 8,
    "title": "NoteEase",
    "companyName": "SmartTools",
    "description": "NoteEase makes note-taking simple and efficient. Sync your notes securely across all devices. Organize ideas with folders and tags. Access your notes anytime, anywhere. Stay productive with NoteEase.",
    "size": 30,
    "reviews": "8.7k",
    "ratingAvg": 4.5,
    "downloads": "2.5M",
    "image": "https://i.ibb.co.com/0pgRBcZB/NoteEase.webp"
  }
]